---
kind: type
id: T:Autodesk.Revit.DB.AppearanceAssetElement
source: html/3493da3a-fea5-69cb-a18e-d0a954615bab.htm
---
# Autodesk.Revit.DB.AppearanceAssetElement

An element that contains a rendering asset used as a portion of a material definition.

## Syntax (C#)
```csharp
public class AppearanceAssetElement : Element
```